MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _ETH_P32MX695F512H_H
#define _ETH_P32MX695F512H_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    ETH_ID_0 = 0,
    ETH_NUMBER_OF_MODULES

} ETH_MODULE_ID;

PLIB_INLINE SFR_TYPE* _ETH_PAUSE_TIMER_VALUE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_ETHERNET_ON_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_STOP_IN_IDLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_REQUEST_TO_SEND_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_AUTO_FLOW_CONTROL_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MANUAL_FLOW_CONTROL_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_BUFCNT_DECREMENT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_DATA_BUFFER_SIZE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHCON2;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_START_ADDRESS_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHTXST;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_START_ADDRESS_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXST;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_HASH_TABLE_LOWER_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHHT0;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_HASH_TABLE_UPPER_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHHT1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PATTERN_MATCH_LOWER_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHPMM0;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PATTERN_MATCH_UPPER_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHPMM1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PATTERN_MATCH_CHECKSUM_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHPMCS;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PATTERN_MATCH_OFFSET_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHPMO;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_HASH_FILTER_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MAGIC_FILTER_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_INVERT_PATTERN_MATCH_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PATTERN_MATCH_MODE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_CRC_ERR_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_CRC_OK_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

