MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _ETH_RUNT_ERR_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RUNT_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_UNICAST_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_NOT_ME_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MULTICAST_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_BROADCAST_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXFC;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_FULL_WMARK_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXWM;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_EMPTY_WMARK_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXWM;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_BUS_ERROR_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_BUS_ERROR_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_EMPTY_WMARK_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_FULL_WMARK_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_DONE_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PACKET_PENDING_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_ACTIVITY_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_DONE_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_ABORT_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_BUFFER_NOTAVAIL_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_FIFO_OVERFLOW_ENABLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIEN;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_BUS_ERROR_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_BUS_ERROR_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_EMPTY_WMARK_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_FULL_WMARK_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_DONE_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PACKET_PENDING_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_ACTIVITY_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_DONE_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_ABORT_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_BUFFER_NOTAVAIL_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_FIFO_OVERFLOW_INT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHIRQ;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_PACKET_BUFFER_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHSTAT;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_ETHERNET_MODULE_BUSY_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHSTAT;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TX_BUSY_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHSTAT;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_BUSY_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHSTAT;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RX_OVERFLOW_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHRXOVFLOW;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_FRAME_TX_OK_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHFRMTXOK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_SINGLE_COL_FRAME_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHSCOLFRM;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MULTI_COL_FRAME_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHMCOLFRM;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_FRAMES_RCVD_OK_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHFRMRXOK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_FCS_ERR_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHFCSERR;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_ALIGNMENT_ERR_COUNT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &ETHALGNERR;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

