MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _ETH_NON_BACK2BACK_IPGAP1_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1IPGR;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_NON_BACK2BACK_IPGAP2_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1IPGR;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_COL_WINDOW_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1CLRT;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RETX_MAX_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1CLRT;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MAX_FRAME_LENGTH_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MAXF;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RESET_RMII_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SUPP;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_SPEED_RMII_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SUPP;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TEST_BACKPRESSURE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1TEST;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_TEST_PAUSE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1TEST;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_SHORTCUT_PAUSE_QUANTA_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1TEST;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_RESET_MIIM_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MCFG;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MII_CLOCK_SEL_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MCFG;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_NO_PREAMBLE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MCFG;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_SCAN_INCREMENT_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MCFG;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_SCAN_MODE_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MCMD;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_READ_COMMAND_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MCMD;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_PHY_ADDRESS_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MADR;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_REGISTER_ADDRESS_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MADR;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_WRITE_DATA_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MWTD;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_READ_DATA_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MRDD;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_LINK_FAILED_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MIND;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_DATA_NOT_VALID_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MIND;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_SCANNING_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MIND;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_MIIM_BUSY_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1MIND;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_STATION_ADDRESS_OCTET_6_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SA0;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_STATION_ADDRESS_OCTET_5_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SA0;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_STATION_ADDRESS_OCTET_4_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SA1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_STATION_ADDRESS_OCTET_3_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SA1;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_STATION_ADDRESS_OCTET_2_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SA2;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ETH_STATION_ADDRESS_OCTET_1_VREG(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return &EMAC1SA2;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PAUSE_TIMER_VALUE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_PTV_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_ETHERNET_ON_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_ON_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STOP_IN_IDLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_SIDL_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

