MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ETH_TX_REQUEST_TO_SEND_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_TXRTS_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_RXEN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_AUTO_FLOW_CONTROL_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_AUTOFC_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MANUAL_FLOW_CONTROL_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_MANFC_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_BUFCNT_DECREMENT_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_BUFCDEC_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_DATA_BUFFER_SIZE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON2_RXBUF_SZ_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_START_ADDRESS_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHTXST_TXSTADDR_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_START_ADDRESS_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXST_RXSTADDR_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_HASH_TABLE_LOWER_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHHT0_HTLOWER_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_HASH_TABLE_UPPER_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHHT1_HTUPPER_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PATTERN_MATCH_LOWER_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHPMM0_PMMLOWER_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PATTERN_MATCH_UPPER_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHPMM1_PMMUPPER_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PATTERN_MATCH_CHECKSUM_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHPMCS_PMCS_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PATTERN_MATCH_OFFSET_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHPMO_PMO_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_HASH_FILTER_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_HTEN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MAGIC_FILTER_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_MPEN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_INVERT_PATTERN_MATCH_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_NOTPM_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PATTERN_MATCH_MODE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_PMMODE_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_CRC_ERR_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_CRCERREN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_CRC_OK_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_CRCOKEN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RUNT_ERR_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_RUNTERREN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RUNT_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_RUNTEN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_UNICAST_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_UCEN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_NOT_ME_ENABLE_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_NOTMEEN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

