MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ETH_MIIM_PHY_ADDRESS_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MADR_PHYADDR_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MIIM_REGISTER_ADDRESS_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MADR_REGADDR_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MIIM_WRITE_DATA_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MWTD_MWTD_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MIIM_READ_DATA_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MRDD_MRDD_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_LINK_FAILED_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MIND_LINKFAIL_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_DATA_NOT_VALID_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MIND_NOTVALID_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MIIM_SCANNING_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MIND_SCAN_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MIIM_BUSY_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1MIND_MIIMBUSY_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STATION_ADDRESS_OCTET_6_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1SA0_STNADDR6_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STATION_ADDRESS_OCTET_5_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1SA0_STNADDR5_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STATION_ADDRESS_OCTET_4_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1SA1_STNADDR4_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STATION_ADDRESS_OCTET_3_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1SA1_STNADDR3_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STATION_ADDRESS_OCTET_2_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1SA2_STNADDR2_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STATION_ADDRESS_OCTET_1_MASK(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1SA2_STNADDR1_MASK;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PAUSE_TIMER_VALUE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_PTV_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_ETHERNET_ON_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_ON_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_STOP_IN_IDLE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_SIDL_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_REQUEST_TO_SEND_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_TXRTS_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_ENABLE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_RXEN_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_AUTO_FLOW_CONTROL_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_AUTOFC_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MANUAL_FLOW_CONTROL_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_MANFC_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_BUFCNT_DECREMENT_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON1_BUFCDEC_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_DATA_BUFFER_SIZE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHCON2_RXBUF_SZ_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_START_ADDRESS_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHTXST_TXSTADDR_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_START_ADDRESS_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXST_RXSTADDR_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

