MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ETH_MULTI_COL_FRAME_COUNT_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHMCOLFRM_MCOLFRMCNT_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_FRAMES_RCVD_OK_COUNT_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHFRMRXOK_FRMRXOKCNT_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_FCS_ERR_COUNT_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHFCSERR_FCSERRCNT_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_ALIGNMENT_ERR_COUNT_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHALGNERR_ALGNERRCNT_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MII_RESET_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_SOFTRESET_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_SIMULATION_RESET_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_SIMRESET_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_MCS_RX_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETRMCS_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_RX_FUNCTION_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETRFUN_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_MCS_TX_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETTMCS_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_TX_FUNCTION_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETTFUN_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MAC_LOOPBACK_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_LOOPBACK_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_FLOW_CONTROL_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_TXPAUSE_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_FLOW_CONTROL_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RXPAUSE_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PASS_ALL_RX_FRAMES_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_PASSALL_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MAC_RX_ENABLE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RXENABLE_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_EXCESS_DEFER_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_EXCESSDFR_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_BACKPRESSURE_NOBACKOFF_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_BPNOBKOFF_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_NO_BACKOFF_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_NOBKOFF_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_LONG_PREAMBLE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_LONGPRE_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PURE_PREAMBLE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_PUREPRE_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_AUTO_DETECT_PAD_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_AUTOPAD_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_VLAN_PAD_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_VLANPAD_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PAD_CRC_ENABLE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_PADENABLE_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_CRC_ENABLE_POS(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_CRCENABLE_POSITION;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

