MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ETH_CRC_ERR_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_CRCERREN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_CRC_OK_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_CRCOKEN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RUNT_ERR_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_RUNTERREN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RUNT_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_RUNTEN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_UNICAST_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_UCEN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_NOT_ME_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_NOTMEEN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MULTICAST_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_MCEN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_BROADCAST_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXFC_BCEN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_FULL_WMARK_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXWM_RXFWM_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_EMPTY_WMARK_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXWM_RXEWM_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_BUS_ERROR_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_TXBUSEIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_BUS_ERROR_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_RXBUSEIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_EMPTY_WMARK_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_EWMARKIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_FULL_WMARK_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_FWMARKIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_DONE_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_RXDONEIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PACKET_PENDING_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_PKTPENDIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_ACTIVITY_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_RXACTIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_DONE_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_TXDONEIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_ABORT_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_TXABORTIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_BUFFER_NOTAVAIL_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_RXBUFNAIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_FIFO_OVERFLOW_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIEN_RXOVFLWIE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_BUS_ERROR_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_TXBUSE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_BUS_ERROR_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_RXBUSE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_EMPTY_WMARK_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_EWMARK_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_FULL_WMARK_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_FWMARK_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

