MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ETH_RX_DONE_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_RXDONE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PACKET_PENDING_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_PKTPEND_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_ACTIVITY_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_RXACT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_DONE_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_TXDONE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_ABORT_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_TXABORT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_BUFFER_NOTAVAIL_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_RXBUFNA_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_FIFO_OVERFLOW_INT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHIRQ_RXOVFLW_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PACKET_BUFFER_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHSTAT_BUFCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_ETHERNET_MODULE_BUSY_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHSTAT_ETHBUSY_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_BUSY_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHSTAT_TXBUSY_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_BUSY_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHSTAT_RXBUSY_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_OVERFLOW_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHRXOVFLOW_RXOVFLWCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_FRAME_TX_OK_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHFRMTXOK_FRMTXOKCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_SINGLE_COL_FRAME_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHSCOLFRM_SCOLFRMCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MULTI_COL_FRAME_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHMCOLFRM_MCOLFRMCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_FRAMES_RCVD_OK_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHFRMRXOK_FRMRXOKCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_FCS_ERR_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHFCSERR_FCSERRCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_ALIGNMENT_ERR_COUNT_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _ETHALGNERR_ALGNERRCNT_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MII_RESET_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_SOFTRESET_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_SIMULATION_RESET_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_SIMRESET_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_MCS_RX_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETRMCS_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_RX_FUNCTION_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETRFUN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_MCS_TX_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETTMCS_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RESET_TX_FUNCTION_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RESETTFUN_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MAC_LOOPBACK_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_LOOPBACK_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_TX_FLOW_CONTROL_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_TXPAUSE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_RX_FLOW_CONTROL_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RXPAUSE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_PASS_ALL_RX_FRAMES_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_PASSALL_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_MAC_RX_ENABLE_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG1_RXENABLE_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_EXCESS_DEFER_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_EXCESSDFR_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ETH_BACKPRESSURE_NOBACKOFF_LEN(ETH_MODULE_ID i)
{
    switch (i) {
        case ETH_ID_0 :
            return _EMAC1CFG2_BPNOBKOFF_LENGTH;
        case ETH_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

