MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE_API void PLIB_ETH_PatternMatchModeSet(ETH_MODULE_ID index, ETH_PATTERN_MATCH_MODE modeSel)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_PatternMatchModeSet_Default(index, modeSel);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API ETH_PATTERN_MATCH_MODE PLIB_ETH_PatternMatchModeGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_PatternMatchModeGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (ETH_PATTERN_MATCH_MODE)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsPatternMatch(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsPatternMatch_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_ReceiveFilterEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_ReceiveFilterEnable_Default(index, filter);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_ReceiveFilterDisable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_ReceiveFilterDisable_Default(index, filter);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ReceiveFilterIsEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ReceiveFilterIsEnable_Default(index, filter);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveFilters(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsReceiveFilters_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_RxFullWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_RxFullWmarkSet_Default(index, watermarkValue);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t PLIB_ETH_RxFullWmarkGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_RxFullWmarkGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_RxEmptyWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_RxEmptyWmarkSet_Default(index, watermarkValue);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t PLIB_ETH_RxEmptyWmarkGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_RxEmptyWmarkGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveWmarks(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsReceiveWmarks_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_InterruptSourceEnable_Default(index, intmask);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_InterruptSourceDisable_Default(index, intmask);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_InterruptSourceIsEnabled(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_InterruptSourceIsEnabled_Default(index, intmask);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptSourcesGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_InterruptSourcesGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (ETH_INTERRUPT_SOURCES)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_InterruptSet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_InterruptSet_Default(index, intmask);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_InterruptClear(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_InterruptClear_Default(index, intmask);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptsGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_InterruptsGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (ETH_INTERRUPT_SOURCES)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_InterruptStatusGet_Default(index, intmask);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsInterrupt(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsInterrupt_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_RxPacketCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_EthernetIsBusy_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_TransmitIsBusy_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

