MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ReceiveIsBusy_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsEthernetControllerStatus(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsEthernetControllerStatus_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_RxOverflowCountClear_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_RxOverflowCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveOverflowCount(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsReceiveOverflowCount_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_FramesTxdOkCountClear_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_FramesTxdOkCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramesTransmittedOK(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsFramesTransmittedOK_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_SingleCollisionCountClear_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_SingleCollisionCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_SingleCollisionCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_MultipleCollisionCountClear(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MultipleCollisionCountClear_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_MultipleCollisionCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MultipleCollisionCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsCollisionCounts(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsCollisionCounts_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_FramesRxdOkCountClear(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_FramesRxdOkCountClear_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_FramesRxdOkCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_FramesRxdOkCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramexReceivedOK(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsFramexReceivedOK_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_FCSErrorCountClear(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_FCSErrorCountClear_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_FCSErrorCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_FCSErrorCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFCSErrorCount(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsFCSErrorCount_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_AlignErrorCountClear(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_AlignErrorCountClear_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_AlignErrorCountGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_AlignErrorCountGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

