MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_ETH_ExistsAlignmentErrorCount(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsAlignmentErrorCount_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_MIIResetEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MIIResetEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_MIIResetDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MIIResetDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_MIIResetIsEnabled(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MIIResetIsEnabled_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_SimResetEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_SimResetEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_SimResetDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_SimResetDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_SimResetIsEnabled(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_SimResetIsEnabled_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_MCSRxResetEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MCSRxResetEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_MCSRxResetDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MCSRxResetDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_MCSRxResetIsEnabled(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MCSRxResetIsEnabled_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_RxFuncResetEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_RxFuncResetEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_RxFuncResetDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_RxFuncResetDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_RxFuncResetIsEnabled(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_RxFuncResetIsEnabled_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MCSTxResetEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MCSTxResetDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MCSTxResetIsEnabled_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_TxFuncResetEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_TxFuncResetDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_TxFuncResetIsEnabled(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_TxFuncResetIsEnabled_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMAC_Resets(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsMAC_Resets_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_LoopbackEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_LoopbackEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_LoopbackDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_LoopbackDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

