MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/eth/processor/eth_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_ETH_ExistsMIIM_Config(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsMIIM_Config_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_MIIMScanModeEnable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MIIMScanModeEnable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_MIIMScanModeDisable(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MIIMScanModeDisable_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_MIIMScanModeIsEnabled(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MIIMScanModeIsEnabled_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIMScanMode(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsMIIMScanMode_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_MIIMReadStart(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MIIMReadStart_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ETH_MIIMWriteStart(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MIIMWriteStart_Default(index);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIMReadWrite(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsMIIMReadWrite_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_ETH_PHYAddressGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_PHYAddressGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_PHYAddressSet(ETH_MODULE_ID index, uint8_t phyAddr)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_PHYAddressSet_Default(index, phyAddr);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t PLIB_ETH_RegisterAddressGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_RegisterAddressGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_RegisterAddressSet(ETH_MODULE_ID index, uint8_t regAddr)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_RegisterAddressSet_Default(index, regAddr);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIMAddresses(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsMIIMAddresses_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_MIIMWriteDataSet(ETH_MODULE_ID index, uint16_t writeData)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_MIIMWriteDataSet_Default(index, writeData);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_ETH_MIIMReadDataGet(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MIIMReadDataGet_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIWriteReadData(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsMIIWriteReadData_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_LinkHasFailed(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_LinkHasFailed_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_DataNotValid(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_DataNotValid_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_MIIMIsScanning(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MIIMIsScanning_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_MIIMIsBusy(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_MIIMIsBusy_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIM_Indicators(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsMIIM_Indicators_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_ETH_StationAddressGet(ETH_MODULE_ID index, uint8_t which)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_StationAddressGet_Default(index, which);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void PLIB_ETH_StationAddressSet(ETH_MODULE_ID index, uint8_t which, uint8_t stationAddress)
{
    switch (index) {
        case ETH_ID_0 :
            ETH_StationAddressSet_Default(index, which, stationAddress);
            break;
        case ETH_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ETH_ExistsStationAddress(ETH_MODULE_ID index)
{
    switch (index) {
        case ETH_ID_0 :
            return ETH_ExistsStationAddress_Default(index);
        case ETH_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

#endif
